src_doc/InformationRegisters/УдалитьКоличествоПисемВПапках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УдалитьКоличествоПисемВПапках</Name>
			<Comment>с 3 0 17</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочтено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Папка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПапкиПисем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/УдалитьКоличествоПисемВПапках/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Удаляет все записи с указанной папкой
//
Процедура ОчиститьЗаписиПоПапке(Папка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = РегистрыСведений.УдалитьКоличествоПисемВПапках.СоздатьНаборЗаписей();
	Набор.Отбор.Папка.Установить(Папка);
	Набор.Записать(Истина);
	
КонецПроцедуры

// Добавляет запись
Процедура ДобавитьЗапись(Папка, Пользователь, Всего, Прочтено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.УдалитьКоличествоПисемВПапках.СоздатьМенеджерЗаписи();
	Запись.Папка = Папка;
	Запись.Пользователь = Пользователь;
	Запись.Всего = Всего;
	Запись.Прочтено = Прочтено;
	Запись.Записать(Истина);
	
КонецПроцедуры

// Возвращает структуру записи регистра, Если Запись не найдена, то возвращает Неопределено.
Функция ПолучитьЗапись(Папка, Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.УдалитьКоличествоПисемВПапках.СоздатьМенеджерЗаписи();
	Запись.Папка = Папка;
	Запись.Пользователь = Пользователь;
	Запись.Прочитать();
	
	Если Не Запись.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Новый Структура("Папка, Пользователь, Всего, Прочтено",
		Запись.Папка,
		Запись.Пользователь,
		Запись.Всего,
		Запись.Прочтено);
	
КонецФункции

#КонецОбласти

#КонецЕсли
